{
  "workshops": [
    {
      "title": "Introduction to Programming in Python",
      "desc": "Introduction to Programming in Python encompasses a comprehensive exploration of the core principles of programming, with a focus on text-based coding using Python. You will delve into programming concepts such as data types, control flow, and functions. Additionally, you will acquire problem-solving skills and develop critical thinking abilities like a programmer, including following the Software Development Life Cycle (SDLC) and working collaboratively in teams.",
      "taught": "Ashwin Talwalkar & Vinay Siva",
      "rel-link": "/workshops/intro-to-programming",
      "level": "0",
      "for": "This curriculum is specifically designed for high school and later middle school students, and it does not require any previous programming experience.",
      "syllabus": "https://docs.google.com/document/d/16YwWUKBiutp4D7xkGocmjlAoM75-z43gHQ2kf4fQe-g/preview",
      "date": "June 26th - July 7th"
    },
    {
      "title": "Introduction to Programming in Java",
      "desc": "Introduction to Programming in Java encompasses a comprehensive exploration of the core principles of programming, with a focus on text-based coding using Java. You will learn core programming principles including data types, control flow, methods, and object-oriented programming skills. Through problem-solving exercises and collaborative teamwork, you will develop critical thinking abilities and follow the Software Development Life Cycle (SDLC). This ciriculum is designed to help better prepare students for the AP Computer Science A.",
      "taught": "Ashwin Talwalkar & Vinay Siva",
      "rel-link": "/workshops/intro-to-programming",
      "level": "0",
      "for": "This curriculum is specifically designed for high school and later middle school students, and it does not require any previous programming experience, however some critical thinking skills are important",
      "syllabus": "",
      "date": "July 10th - July 21st"
    },
    {
      "title": "Intro to Web Development",
      "desc": "Learn everything you need to know to build web based application. You'll explore topics such as HTML, CSS, and JavaScript, the three foundational technologies of the web, and discover how to use them to design and structure web apps, add multimedia content, and make your site responsive to different devices. Additionally, you will acquire problem-solving skills and develop critical thinking abilities like a programmer, including following the Software Development Life Cycle (SDLC) and working collaboratively in teams.",
      "taught": "Ashwin Talwalkar",
      "rel-link": "/workshops/intro-to-web-dev",
      "level": "0",
      "for": "This curriculum is specifically designed for high school and later middle school students, and it does not require any previous programming experience.",
      "syllabus": "https://docs.google.com/document/d/1of2lCZW2P0P7XTEaQZt46v3_FLh1Vz4OL7PCdGpbHsc/preview",
      "date": "July 24th - August 4th"
    }
    
  ]
}